program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.7.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp32, [1, 3, 224, 224]> pixel_values) {
            string var_30_pad_type_0 = const()[name = string("op_30_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> var_30_strides_0 = const()[name = string("op_30_strides_0"), val = tensor<int32, [2]>([14, 14])];
            tensor<int32, [4]> var_30_pad_0 = const()[name = string("op_30_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_30_dilations_0 = const()[name = string("op_30_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 var_30_groups_0 = const()[name = string("op_30_groups_0"), val = int32(1)];
            string pixel_values_to_fp16_dtype_0 = const()[name = string("pixel_values_to_fp16_dtype_0"), val = string("fp16")];
            tensor<fp16, [384, 3, 14, 14]> model_embeddings_patch_embeddings_projection_weight_to_fp16 = const()[name = string("model_embeddings_patch_embeddings_projection_weight_to_fp16"), val = tensor<fp16, [384, 3, 14, 14]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64)))];
            tensor<fp16, [384]> model_embeddings_patch_embeddings_projection_bias_to_fp16 = const()[name = string("model_embeddings_patch_embeddings_projection_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(451712)))];
            tensor<fp16, [1, 3, 224, 224]> pixel_values_to_fp16 = cast(dtype = pixel_values_to_fp16_dtype_0, x = pixel_values)[name = string("cast_50")];
            tensor<fp16, [1, 384, 16, 16]> var_30_cast_fp16 = conv(bias = model_embeddings_patch_embeddings_projection_bias_to_fp16, dilations = var_30_dilations_0, groups = var_30_groups_0, pad = var_30_pad_0, pad_type = var_30_pad_type_0, strides = var_30_strides_0, weight = model_embeddings_patch_embeddings_projection_weight_to_fp16, x = pixel_values_to_fp16)[name = string("op_30_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = string("concat_0"), val = tensor<int32, [3]>([1, 384, 256])];
            tensor<fp16, [1, 384, 256]> var_33_cast_fp16 = reshape(shape = concat_0, x = var_30_cast_fp16)[name = string("op_33_cast_fp16")];
            tensor<int32, [3]> embeddings_1_perm_0 = const()[name = string("embeddings_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            int32 var_38 = const()[name = string("op_38"), val = int32(1)];
            bool embeddings_3_interleave_0 = const()[name = string("embeddings_3_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 1, 384]> model_embeddings_cls_token_to_fp16 = const()[name = string("model_embeddings_cls_token_to_fp16"), val = tensor<fp16, [1, 1, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(452544)))];
            tensor<fp16, [1, 256, 384]> embeddings_1_cast_fp16 = transpose(perm = embeddings_1_perm_0, x = var_33_cast_fp16)[name = string("transpose_120")];
            tensor<fp16, [1, 257, 384]> embeddings_3_cast_fp16 = concat(axis = var_38, interleave = embeddings_3_interleave_0, values = (model_embeddings_cls_token_to_fp16, embeddings_1_cast_fp16))[name = string("embeddings_3_cast_fp16")];
            tensor<fp16, [1, 257, 384]> static_position_embeddings_to_fp16 = const()[name = string("static_position_embeddings_to_fp16"), val = tensor<fp16, [1, 257, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(453376)))];
            tensor<fp16, [1, 257, 384]> input_3_cast_fp16 = add(x = embeddings_3_cast_fp16, y = static_position_embeddings_to_fp16)[name = string("input_3_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = string("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_0_norm1_weight_to_fp16 = const()[name = string("model_encoder_layer_0_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(650816)))];
            tensor<fp16, [384]> model_encoder_layer_0_norm1_bias_to_fp16 = const()[name = string("model_encoder_layer_0_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(651648)))];
            fp16 var_46_to_fp16 = const()[name = string("op_46_to_fp16"), val = fp16(0x1.1p-20)];
            tensor<fp16, [1, 257, 384]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = model_encoder_layer_0_norm1_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_0_norm1_weight_to_fp16, x = input_3_cast_fp16)[name = string("hidden_states_1_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_attention_key_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(652480)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_attention_key_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(947456)))];
            tensor<fp16, [1, 257, 384]> linear_0_cast_fp16 = linear(bias = model_encoder_layer_0_attention_attention_key_bias_to_fp16, weight = model_encoder_layer_0_attention_attention_key_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = string("linear_0_cast_fp16")];
            tensor<int32, [4]> var_102 = const()[name = string("op_102"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_103_cast_fp16 = reshape(shape = var_102, x = linear_0_cast_fp16)[name = string("op_103_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_attention_value_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(948288)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_attention_value_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1243264)))];
            tensor<fp16, [1, 257, 384]> linear_1_cast_fp16 = linear(bias = model_encoder_layer_0_attention_attention_value_bias_to_fp16, weight = model_encoder_layer_0_attention_attention_value_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = string("linear_1_cast_fp16")];
            tensor<int32, [4]> var_108 = const()[name = string("op_108"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_109_cast_fp16 = reshape(shape = var_108, x = linear_1_cast_fp16)[name = string("op_109_cast_fp16")];
            tensor<int32, [4]> value_1_perm_0 = const()[name = string("value_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_attention_query_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1244096)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_attention_query_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1539072)))];
            tensor<fp16, [1, 257, 384]> linear_2_cast_fp16 = linear(bias = model_encoder_layer_0_attention_attention_query_bias_to_fp16, weight = model_encoder_layer_0_attention_attention_query_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = string("linear_2_cast_fp16")];
            tensor<int32, [4]> var_114 = const()[name = string("op_114"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_115_cast_fp16 = reshape(shape = var_114, x = linear_2_cast_fp16)[name = string("op_115_cast_fp16")];
            fp16 var_57_to_fp16 = const()[name = string("op_57_to_fp16"), val = fp16(0x1p-3)];
            tensor<fp16, [1, 257, 6, 64]> mul_0_cast_fp16 = mul(x = var_115_cast_fp16, y = var_57_to_fp16)[name = string("mul_0_cast_fp16")];
            bool matmul_0_transpose_y_0 = const()[name = string("matmul_0_transpose_y_0"), val = bool(true)];
            bool matmul_0_transpose_x_0 = const()[name = string("matmul_0_transpose_x_0"), val = bool(false)];
            tensor<int32, [4]> transpose_48_perm_0 = const()[name = string("transpose_48_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = string("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_49 = transpose(perm = transpose_49_perm_0, x = var_103_cast_fp16)[name = string("transpose_117")];
            tensor<fp16, [1, 6, 257, 64]> transpose_48 = transpose(perm = transpose_48_perm_0, x = mul_0_cast_fp16)[name = string("transpose_118")];
            tensor<fp16, [1, 6, 257, 257]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_48, y = transpose_49)[name = string("matmul_0_cast_fp16")];
            int32 softmax_0_axis_0 = const()[name = string("softmax_0_axis_0"), val = int32(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = string("softmax_0_cast_fp16")];
            bool attn_output_1_transpose_x_0 = const()[name = string("attn_output_1_transpose_x_0"), val = bool(false)];
            bool attn_output_1_transpose_y_0 = const()[name = string("attn_output_1_transpose_y_0"), val = bool(false)];
            tensor<fp16, [1, 6, 257, 64]> value_1_cast_fp16 = transpose(perm = value_1_perm_0, x = var_109_cast_fp16)[name = string("transpose_119")];
            tensor<fp16, [1, 6, 257, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = softmax_0_cast_fp16, y = value_1_cast_fp16)[name = string("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_118_perm_0 = const()[name = string("op_118_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_122 = const()[name = string("op_122"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_118_cast_fp16 = transpose(perm = var_118_perm_0, x = attn_output_1_cast_fp16)[name = string("transpose_116")];
            tensor<fp16, [1, 257, 384]> input_7_cast_fp16 = reshape(shape = var_122, x = var_118_cast_fp16)[name = string("input_7_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_output_dense_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1539904)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1834880)))];
            tensor<fp16, [1, 257, 384]> linear_3_cast_fp16 = linear(bias = model_encoder_layer_0_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_0_attention_output_dense_weight_to_fp16, x = input_7_cast_fp16)[name = string("linear_3_cast_fp16")];
            tensor<fp16, [384]> model_encoder_layer_0_layer_scale1_lambda1_to_fp16 = const()[name = string("model_encoder_layer_0_layer_scale1_lambda1_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1835712)))];
            tensor<fp16, [1, 257, 384]> self_attention_output_1_cast_fp16 = mul(x = linear_3_cast_fp16, y = model_encoder_layer_0_layer_scale1_lambda1_to_fp16)[name = string("self_attention_output_1_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_11_cast_fp16 = add(x = self_attention_output_1_cast_fp16, y = input_3_cast_fp16)[name = string("input_11_cast_fp16")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = string("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_0_norm2_weight_to_fp16 = const()[name = string("model_encoder_layer_0_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1836544)))];
            tensor<fp16, [384]> model_encoder_layer_0_norm2_bias_to_fp16 = const()[name = string("model_encoder_layer_0_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1837376)))];
            tensor<fp16, [1, 257, 384]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = model_encoder_layer_0_norm2_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_0_norm2_weight_to_fp16, x = input_11_cast_fp16)[name = string("input_13_cast_fp16")];
            tensor<fp16, [1536, 384]> model_encoder_layer_0_mlp_fc1_weight_to_fp16 = const()[name = string("model_encoder_layer_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1838208)))];
            tensor<fp16, [1536]> model_encoder_layer_0_mlp_fc1_bias_to_fp16 = const()[name = string("model_encoder_layer_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(3017920)))];
            tensor<fp16, [1, 257, 1536]> linear_4_cast_fp16 = linear(bias = model_encoder_layer_0_mlp_fc1_bias_to_fp16, weight = model_encoder_layer_0_mlp_fc1_weight_to_fp16, x = input_13_cast_fp16)[name = string("linear_4_cast_fp16")];
            string input_17_mode_0 = const()[name = string("input_17_mode_0"), val = string("EXACT")];
            tensor<fp16, [1, 257, 1536]> input_17_cast_fp16 = gelu(mode = input_17_mode_0, x = linear_4_cast_fp16)[name = string("input_17_cast_fp16")];
            tensor<fp16, [384, 1536]> model_encoder_layer_0_mlp_fc2_weight_to_fp16 = const()[name = string("model_encoder_layer_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(3021056)))];
            tensor<fp16, [384]> model_encoder_layer_0_mlp_fc2_bias_to_fp16 = const()[name = string("model_encoder_layer_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4200768)))];
            tensor<fp16, [1, 257, 384]> linear_5_cast_fp16 = linear(bias = model_encoder_layer_0_mlp_fc2_bias_to_fp16, weight = model_encoder_layer_0_mlp_fc2_weight_to_fp16, x = input_17_cast_fp16)[name = string("linear_5_cast_fp16")];
            tensor<fp16, [384]> model_encoder_layer_0_layer_scale2_lambda1_to_fp16 = const()[name = string("model_encoder_layer_0_layer_scale2_lambda1_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4201600)))];
            tensor<fp16, [1, 257, 384]> layer_output_1_cast_fp16 = mul(x = linear_5_cast_fp16, y = model_encoder_layer_0_layer_scale2_lambda1_to_fp16)[name = string("layer_output_1_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_19_cast_fp16 = add(x = layer_output_1_cast_fp16, y = input_11_cast_fp16)[name = string("input_19_cast_fp16")];
            tensor<int32, [1]> hidden_states_3_axes_0 = const()[name = string("hidden_states_3_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_1_norm1_weight_to_fp16 = const()[name = string("model_encoder_layer_1_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4202432)))];
            tensor<fp16, [384]> model_encoder_layer_1_norm1_bias_to_fp16 = const()[name = string("model_encoder_layer_1_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4203264)))];
            tensor<fp16, [1, 257, 384]> hidden_states_3_cast_fp16 = layer_norm(axes = hidden_states_3_axes_0, beta = model_encoder_layer_1_norm1_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_1_norm1_weight_to_fp16, x = input_19_cast_fp16)[name = string("hidden_states_3_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_attention_key_weight_to_fp16 = const()[name = string("model_encoder_layer_1_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4204096)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_attention_key_bias_to_fp16 = const()[name = string("model_encoder_layer_1_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4499072)))];
            tensor<fp16, [1, 257, 384]> linear_6_cast_fp16 = linear(bias = model_encoder_layer_1_attention_attention_key_bias_to_fp16, weight = model_encoder_layer_1_attention_attention_key_weight_to_fp16, x = hidden_states_3_cast_fp16)[name = string("linear_6_cast_fp16")];
            tensor<int32, [4]> var_167 = const()[name = string("op_167"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_168_cast_fp16 = reshape(shape = var_167, x = linear_6_cast_fp16)[name = string("op_168_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_attention_value_weight_to_fp16 = const()[name = string("model_encoder_layer_1_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4499904)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_attention_value_bias_to_fp16 = const()[name = string("model_encoder_layer_1_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4794880)))];
            tensor<fp16, [1, 257, 384]> linear_7_cast_fp16 = linear(bias = model_encoder_layer_1_attention_attention_value_bias_to_fp16, weight = model_encoder_layer_1_attention_attention_value_weight_to_fp16, x = hidden_states_3_cast_fp16)[name = string("linear_7_cast_fp16")];
            tensor<int32, [4]> var_173 = const()[name = string("op_173"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_174_cast_fp16 = reshape(shape = var_173, x = linear_7_cast_fp16)[name = string("op_174_cast_fp16")];
            tensor<int32, [4]> value_3_perm_0 = const()[name = string("value_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_attention_query_weight_to_fp16 = const()[name = string("model_encoder_layer_1_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4795712)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_attention_query_bias_to_fp16 = const()[name = string("model_encoder_layer_1_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5090688)))];
            tensor<fp16, [1, 257, 384]> linear_8_cast_fp16 = linear(bias = model_encoder_layer_1_attention_attention_query_bias_to_fp16, weight = model_encoder_layer_1_attention_attention_query_weight_to_fp16, x = hidden_states_3_cast_fp16)[name = string("linear_8_cast_fp16")];
            tensor<int32, [4]> var_179 = const()[name = string("op_179"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_180_cast_fp16 = reshape(shape = var_179, x = linear_8_cast_fp16)[name = string("op_180_cast_fp16")];
            tensor<fp16, [1, 257, 6, 64]> mul_1_cast_fp16 = mul(x = var_180_cast_fp16, y = var_57_to_fp16)[name = string("mul_1_cast_fp16")];
            bool matmul_1_transpose_y_0 = const()[name = string("matmul_1_transpose_y_0"), val = bool(true)];
            bool matmul_1_transpose_x_0 = const()[name = string("matmul_1_transpose_x_0"), val = bool(false)];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = string("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = string("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_51 = transpose(perm = transpose_51_perm_0, x = var_168_cast_fp16)[name = string("transpose_113")];
            tensor<fp16, [1, 6, 257, 64]> transpose_50 = transpose(perm = transpose_50_perm_0, x = mul_1_cast_fp16)[name = string("transpose_114")];
            tensor<fp16, [1, 6, 257, 257]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_50, y = transpose_51)[name = string("matmul_1_cast_fp16")];
            int32 softmax_1_axis_0 = const()[name = string("softmax_1_axis_0"), val = int32(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = string("softmax_1_cast_fp16")];
            bool attn_output_3_transpose_x_0 = const()[name = string("attn_output_3_transpose_x_0"), val = bool(false)];
            bool attn_output_3_transpose_y_0 = const()[name = string("attn_output_3_transpose_y_0"), val = bool(false)];
            tensor<fp16, [1, 6, 257, 64]> value_3_cast_fp16 = transpose(perm = value_3_perm_0, x = var_174_cast_fp16)[name = string("transpose_115")];
            tensor<fp16, [1, 6, 257, 64]> attn_output_3_cast_fp16 = matmul(transpose_x = attn_output_3_transpose_x_0, transpose_y = attn_output_3_transpose_y_0, x = softmax_1_cast_fp16, y = value_3_cast_fp16)[name = string("attn_output_3_cast_fp16")];
            tensor<int32, [4]> var_183_perm_0 = const()[name = string("op_183_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_187 = const()[name = string("op_187"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_183_cast_fp16 = transpose(perm = var_183_perm_0, x = attn_output_3_cast_fp16)[name = string("transpose_112")];
            tensor<fp16, [1, 257, 384]> input_21_cast_fp16 = reshape(shape = var_187, x = var_183_cast_fp16)[name = string("input_21_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_output_dense_weight_to_fp16 = const()[name = string("model_encoder_layer_1_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5091520)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_1_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5386496)))];
            tensor<fp16, [1, 257, 384]> linear_9_cast_fp16 = linear(bias = model_encoder_layer_1_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_1_attention_output_dense_weight_to_fp16, x = input_21_cast_fp16)[name = string("linear_9_cast_fp16")];
            tensor<fp16, [384]> model_encoder_layer_1_layer_scale1_lambda1_to_fp16 = const()[name = string("model_encoder_layer_1_layer_scale1_lambda1_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5387328)))];
            tensor<fp16, [1, 257, 384]> self_attention_output_3_cast_fp16 = mul(x = linear_9_cast_fp16, y = model_encoder_layer_1_layer_scale1_lambda1_to_fp16)[name = string("self_attention_output_3_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_25_cast_fp16 = add(x = self_attention_output_3_cast_fp16, y = input_19_cast_fp16)[name = string("input_25_cast_fp16")];
            tensor<int32, [1]> input_27_axes_0 = const()[name = string("input_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_1_norm2_weight_to_fp16 = const()[name = string("model_encoder_layer_1_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5388160)))];
            tensor<fp16, [384]> model_encoder_layer_1_norm2_bias_to_fp16 = const()[name = string("model_encoder_layer_1_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5388992)))];
            tensor<fp16, [1, 257, 384]> input_27_cast_fp16 = layer_norm(axes = input_27_axes_0, beta = model_encoder_layer_1_norm2_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_1_norm2_weight_to_fp16, x = input_25_cast_fp16)[name = string("input_27_cast_fp16")];
            tensor<fp16, [1536, 384]> model_encoder_layer_1_mlp_fc1_weight_to_fp16 = const()[name = string("model_encoder_layer_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5389824)))];
            tensor<fp16, [1536]> model_encoder_layer_1_mlp_fc1_bias_to_fp16 = const()[name = string("model_encoder_layer_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6569536)))];
            tensor<fp16, [1, 257, 1536]> linear_10_cast_fp16 = linear(bias = model_encoder_layer_1_mlp_fc1_bias_to_fp16, weight = model_encoder_layer_1_mlp_fc1_weight_to_fp16, x = input_27_cast_fp16)[name = string("linear_10_cast_fp16")];
            string input_31_mode_0 = const()[name = string("input_31_mode_0"), val = string("EXACT")];
            tensor<fp16, [1, 257, 1536]> input_31_cast_fp16 = gelu(mode = input_31_mode_0, x = linear_10_cast_fp16)[name = string("input_31_cast_fp16")];
            tensor<fp16, [384, 1536]> model_encoder_layer_1_mlp_fc2_weight_to_fp16 = const()[name = string("model_encoder_layer_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6572672)))];
            tensor<fp16, [384]> model_encoder_layer_1_mlp_fc2_bias_to_fp16 = const()[name = string("model_encoder_layer_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(7752384)))];
            tensor<fp16, [1, 257, 384]> linear_11_cast_fp16 = linear(bias = model_encoder_layer_1_mlp_fc2_bias_to_fp16, weight = model_encoder_layer_1_mlp_fc2_weight_to_fp16, x = input_31_cast_fp16)[name = string("linear_11_cast_fp16")];
            tensor<fp16, [384]> model_encoder_layer_1_layer_scale2_lambda1_to_fp16 = const()[name = string("model_encoder_layer_1_layer_scale2_lambda1_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(7753216)))];
            tensor<fp16, [1, 257, 384]> layer_output_3_cast_fp16 = mul(x = linear_11_cast_fp16, y = model_encoder_layer_1_layer_scale2_lambda1_to_fp16)[name = string("layer_output_3_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_33_cast_fp16 = add(x = layer_output_3_cast_fp16, y = input_25_cast_fp16)[name = string("input_33_cast_fp16")];
            tensor<int32, [1]> hidden_states_5_axes_0 = const()[name = string("hidden_states_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_2_norm1_weight_to_fp16 = const()[name = string("model_encoder_layer_2_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(7754048)))];
            tensor<fp16, [384]> model_encoder_layer_2_norm1_bias_to_fp16 = const()[name = string("model_encoder_layer_2_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(7754880)))];
            tensor<fp16, [1, 257, 384]> hidden_states_5_cast_fp16 = layer_norm(axes = hidden_states_5_axes_0, beta = model_encoder_layer_2_norm1_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_2_norm1_weight_to_fp16, x = input_33_cast_fp16)[name = string("hidden_states_5_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_2_attention_attention_key_weight_to_fp16 = const()[name = string("model_encoder_layer_2_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(7755712)))];
            tensor<fp16, [384]> model_encoder_layer_2_attention_attention_key_bias_to_fp16 = const()[name = string("model_encoder_layer_2_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8050688)))];
            tensor<fp16, [1, 257, 384]> linear_12_cast_fp16 = linear(bias = model_encoder_layer_2_attention_attention_key_bias_to_fp16, weight = model_encoder_layer_2_attention_attention_key_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = string("linear_12_cast_fp16")];
            tensor<int32, [4]> var_232 = const()[name = string("op_232"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_233_cast_fp16 = reshape(shape = var_232, x = linear_12_cast_fp16)[name = string("op_233_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_2_attention_attention_value_weight_to_fp16 = const()[name = string("model_encoder_layer_2_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8051520)))];
            tensor<fp16, [384]> model_encoder_layer_2_attention_attention_value_bias_to_fp16 = const()[name = string("model_encoder_layer_2_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8346496)))];
            tensor<fp16, [1, 257, 384]> linear_13_cast_fp16 = linear(bias = model_encoder_layer_2_attention_attention_value_bias_to_fp16, weight = model_encoder_layer_2_attention_attention_value_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = string("linear_13_cast_fp16")];
            tensor<int32, [4]> var_238 = const()[name = string("op_238"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_239_cast_fp16 = reshape(shape = var_238, x = linear_13_cast_fp16)[name = string("op_239_cast_fp16")];
            tensor<int32, [4]> value_5_perm_0 = const()[name = string("value_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> model_encoder_layer_2_attention_attention_query_weight_to_fp16 = const()[name = string("model_encoder_layer_2_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8347328)))];
            tensor<fp16, [384]> model_encoder_layer_2_attention_attention_query_bias_to_fp16 = const()[name = string("model_encoder_layer_2_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8642304)))];
            tensor<fp16, [1, 257, 384]> linear_14_cast_fp16 = linear(bias = model_encoder_layer_2_attention_attention_query_bias_to_fp16, weight = model_encoder_layer_2_attention_attention_query_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = string("linear_14_cast_fp16")];
            tensor<int32, [4]> var_244 = const()[name = string("op_244"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_245_cast_fp16 = reshape(shape = var_244, x = linear_14_cast_fp16)[name = string("op_245_cast_fp16")];
            tensor<fp16, [1, 257, 6, 64]> mul_2_cast_fp16 = mul(x = var_245_cast_fp16, y = var_57_to_fp16)[name = string("mul_2_cast_fp16")];
            bool matmul_2_transpose_y_0 = const()[name = string("matmul_2_transpose_y_0"), val = bool(true)];
            bool matmul_2_transpose_x_0 = const()[name = string("matmul_2_transpose_x_0"), val = bool(false)];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = string("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_53_perm_0 = const()[name = string("transpose_53_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_53 = transpose(perm = transpose_53_perm_0, x = var_233_cast_fp16)[name = string("transpose_109")];
            tensor<fp16, [1, 6, 257, 64]> transpose_52 = transpose(perm = transpose_52_perm_0, x = mul_2_cast_fp16)[name = string("transpose_110")];
            tensor<fp16, [1, 6, 257, 257]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_52, y = transpose_53)[name = string("matmul_2_cast_fp16")];
            int32 softmax_2_axis_0 = const()[name = string("softmax_2_axis_0"), val = int32(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = string("softmax_2_cast_fp16")];
            bool attn_output_5_transpose_x_0 = const()[name = string("attn_output_5_transpose_x_0"), val = bool(false)];
            bool attn_output_5_transpose_y_0 = const()[name = string("attn_output_5_transpose_y_0"), val = bool(false)];
            tensor<fp16, [1, 6, 257, 64]> value_5_cast_fp16 = transpose(perm = value_5_perm_0, x = var_239_cast_fp16)[name = string("transpose_111")];
            tensor<fp16, [1, 6, 257, 64]> attn_output_5_cast_fp16 = matmul(transpose_x = attn_output_5_transpose_x_0, transpose_y = attn_output_5_transpose_y_0, x = softmax_2_cast_fp16, y = value_5_cast_fp16)[name = string("attn_output_5_cast_fp16")];
            tensor<int32, [4]> var_248_perm_0 = const()[name = string("op_248_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_252 = const()[name = string("op_252"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_248_cast_fp16 = transpose(perm = var_248_perm_0, x = attn_output_5_cast_fp16)[name = string("transpose_108")];
            tensor<fp16, [1, 257, 384]> input_35_cast_fp16 = reshape(shape = var_252, x = var_248_cast_fp16)[name = string("input_35_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_2_attention_output_dense_weight_to_fp16 = const()[name = string("model_encoder_layer_2_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8643136)))];
            tensor<fp16, [384]> model_encoder_layer_2_attention_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_2_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8938112)))];
            tensor<fp16, [1, 257, 384]> linear_15_cast_fp16 = linear(bias = model_encoder_layer_2_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_2_attention_output_dense_weight_to_fp16, x = input_35_cast_fp16)[name = string("linear_15_cast_fp16")];
            tensor<fp16, [384]> model_encoder_layer_2_layer_scale1_lambda1_to_fp16 = const()[name = string("model_encoder_layer_2_layer_scale1_lambda1_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8938944)))];
            tensor<fp16, [1, 257, 384]> self_attention_output_5_cast_fp16 = mul(x = linear_15_cast_fp16, y = model_encoder_layer_2_layer_scale1_lambda1_to_fp16)[name = string("self_attention_output_5_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_39_cast_fp16 = add(x = self_attention_output_5_cast_fp16, y = input_33_cast_fp16)[name = string("input_39_cast_fp16")];
            tensor<int32, [1]> input_41_axes_0 = const()[name = string("input_41_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_2_norm2_weight_to_fp16 = const()[name = string("model_encoder_layer_2_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8939776)))];
            tensor<fp16, [384]> model_encoder_layer_2_norm2_bias_to_fp16 = const()[name = string("model_encoder_layer_2_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8940608)))];
            tensor<fp16, [1, 257, 384]> input_41_cast_fp16 = layer_norm(axes = input_41_axes_0, beta = model_encoder_layer_2_norm2_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_2_norm2_weight_to_fp16, x = input_39_cast_fp16)[name = string("input_41_cast_fp16")];
            tensor<fp16, [1536, 384]> model_encoder_layer_2_mlp_fc1_weight_to_fp16 = const()[name = string("model_encoder_layer_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(8941440)))];
            tensor<fp16, [1536]> model_encoder_layer_2_mlp_fc1_bias_to_fp16 = const()[name = string("model_encoder_layer_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(10121152)))];
            tensor<fp16, [1, 257, 1536]> linear_16_cast_fp16 = linear(bias = model_encoder_layer_2_mlp_fc1_bias_to_fp16, weight = model_encoder_layer_2_mlp_fc1_weight_to_fp16, x = input_41_cast_fp16)[name = string("linear_16_cast_fp16")];
            string input_45_mode_0 = const()[name = string("input_45_mode_0"), val = string("EXACT")];
            tensor<fp16, [1, 257, 1536]> input_45_cast_fp16 = gelu(mode = input_45_mode_0, x = linear_16_cast_fp16)[name = string("input_45_cast_fp16")];
            tensor<fp16, [384, 1536]> model_encoder_layer_2_mlp_fc2_weight_to_fp16 = const()[name = string("model_encoder_layer_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(10124288)))];
            tensor<fp16, [384]> model_encoder_layer_2_mlp_fc2_bias_to_fp16 = const()[name = string("model_encoder_layer_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11304000)))];
            tensor<fp16, [1, 257, 384]> linear_17_cast_fp16 = linear(bias = model_encoder_layer_2_mlp_fc2_bias_to_fp16, weight = model_encoder_layer_2_mlp_fc2_weight_to_fp16, x = input_45_cast_fp16)[name = string("linear_17_cast_fp16")];
            tensor<fp16, [384]> model_encoder_layer_2_layer_scale2_lambda1_to_fp16 = const()[name = string("model_encoder_layer_2_layer_scale2_lambda1_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11304832)))];
            tensor<fp16, [1, 257, 384]> layer_output_5_cast_fp16 = mul(x = linear_17_cast_fp16, y = model_encoder_layer_2_layer_scale2_lambda1_to_fp16)[name = string("layer_output_5_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_47_cast_fp16 = add(x = layer_output_5_cast_fp16, y = input_39_cast_fp16)[name = string("input_47_cast_fp16")];
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = string("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_3_norm1_weight_to_fp16 = const()[name = string("model_encoder_layer_3_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11305664)))];
            tensor<fp16, [384]> model_encoder_layer_3_norm1_bias_to_fp16 = const()[name = string("model_encoder_layer_3_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11306496)))];
            tensor<fp16, [1, 257, 384]> hidden_states_7_cast_fp16 = layer_norm(axes = hidden_states_7_axes_0, beta = model_encoder_layer_3_norm1_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_3_norm1_weight_to_fp16, x = input_47_cast_fp16)[name = string("hidden_states_7_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_3_attention_attention_key_weight_to_fp16 = const()[name = string("model_encoder_layer_3_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11307328)))];
            tensor<fp16, [384]> model_encoder_layer_3_attention_attention_key_bias_to_fp16 = const()[name = string("model_encoder_layer_3_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11602304)))];
            tensor<fp16, [1, 257, 384]> linear_18_cast_fp16 = linear(bias = model_encoder_layer_3_attention_attention_key_bias_to_fp16, weight = model_encoder_layer_3_attention_attention_key_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = string("linear_18_cast_fp16")];
            tensor<int32, [4]> var_297 = const()[name = string("op_297"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_298_cast_fp16 = reshape(shape = var_297, x = linear_18_cast_fp16)[name = string("op_298_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_3_attention_attention_value_weight_to_fp16 = const()[name = string("model_encoder_layer_3_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11603136)))];
            tensor<fp16, [384]> model_encoder_layer_3_attention_attention_value_bias_to_fp16 = const()[name = string("model_encoder_layer_3_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11898112)))];
            tensor<fp16, [1, 257, 384]> linear_19_cast_fp16 = linear(bias = model_encoder_layer_3_attention_attention_value_bias_to_fp16, weight = model_encoder_layer_3_attention_attention_value_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = string("linear_19_cast_fp16")];
            tensor<int32, [4]> var_303 = const()[name = string("op_303"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_304_cast_fp16 = reshape(shape = var_303, x = linear_19_cast_fp16)[name = string("op_304_cast_fp16")];
            tensor<int32, [4]> value_7_perm_0 = const()[name = string("value_7_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> model_encoder_layer_3_attention_attention_query_weight_to_fp16 = const()[name = string("model_encoder_layer_3_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11898944)))];
            tensor<fp16, [384]> model_encoder_layer_3_attention_attention_query_bias_to_fp16 = const()[name = string("model_encoder_layer_3_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12193920)))];
            tensor<fp16, [1, 257, 384]> linear_20_cast_fp16 = linear(bias = model_encoder_layer_3_attention_attention_query_bias_to_fp16, weight = model_encoder_layer_3_attention_attention_query_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = string("linear_20_cast_fp16")];
            tensor<int32, [4]> var_309 = const()[name = string("op_309"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 257, 6, 64]> var_310_cast_fp16 = reshape(shape = var_309, x = linear_20_cast_fp16)[name = string("op_310_cast_fp16")];
            tensor<fp16, [1, 257, 6, 64]> mul_3_cast_fp16 = mul(x = var_310_cast_fp16, y = var_57_to_fp16)[name = string("mul_3_cast_fp16")];
            bool matmul_3_transpose_y_0 = const()[name = string("matmul_3_transpose_y_0"), val = bool(true)];
            bool matmul_3_transpose_x_0 = const()[name = string("matmul_3_transpose_x_0"), val = bool(false)];
            tensor<int32, [4]> transpose_54_perm_0 = const()[name = string("transpose_54_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_55_perm_0 = const()[name = string("transpose_55_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_55 = transpose(perm = transpose_55_perm_0, x = var_298_cast_fp16)[name = string("transpose_105")];
            tensor<fp16, [1, 6, 257, 64]> transpose_54 = transpose(perm = transpose_54_perm_0, x = mul_3_cast_fp16)[name = string("transpose_106")];
            tensor<fp16, [1, 6, 257, 257]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = transpose_54, y = transpose_55)[name = string("matmul_3_cast_fp16")];
            int32 softmax_3_axis_0 = const()[name = string("softmax_3_axis_0"), val = int32(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_3_cast_fp16 = softmax(axis = softmax_3_axis_0, x = matmul_3_cast_fp16)[name = string("softmax_3_cast_fp16")];
            bool attn_output_7_transpose_x_0 = const()[name = string("attn_output_7_transpose_x_0"), val = bool(false)];
            bool attn_output_7_transpose_y_0 = const()[name = string("attn_output_7_transpose_y_0"), val = bool(false)];
            tensor<fp16, [1, 6, 257, 64]> value_7_cast_fp16 = transpose(perm = value_7_perm_0, x = var_304_cast_fp16)[name = string("transpose_107")];
            tensor<fp16, [1, 6, 257, 64]> attn_output_7_cast_fp16 = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = softmax_3_cast_fp16, y = value_7_cast_fp16)[name = string("attn_output_7_cast_fp16")];
            tensor<int32, [4]> var_313_perm_0 = const()[name = string("op_313_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_317 = const()[name = string("op_317"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_313_cast_fp16 = transpose(perm = var_313_perm_0, x = attn_output_7_cast_fp16)[name = string("transpose_104")];
            tensor<fp16, [1, 257, 384]> input_49_cast_fp16 = reshape(shape = var_317, x = var_313_cast_fp16)[name = string("input_49_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_3_attention_output_dense_weight_to_fp16 = const()[name = string("model_encoder_layer_3_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12194752)))];
            tensor<fp16, [384]> model_encoder_layer_3_attention_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_3_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12489728)))];
            tensor<fp16, [1, 257, 384]> linear_21_cast_fp16 = linear(bias = model_encoder_layer_3_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_3_attention_output_dense_weight_to_fp16, x = input_49_cast_fp16)[name = string("linear_21_cast_fp16")];
            tensor<fp16, [384]> model_encoder_layer_3_layer_scale1_lambda1_to_fp16 = const()[name = string("model_encoder_layer_3_layer_scale1_lambda1_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12490560)))];
            tensor<fp16, [1, 257, 384]> self_attention_output_7_cast_fp16 = mul(x = linear_21_cast_fp16, y = model_encoder_layer_3_layer_scale1_lambda1_to_fp16)[name = string("self_attention_output_7_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_53_cast_fp16 = add(x = self_attention_output_7_cast_fp16, y = input_47_cast_fp16)[name = string("input_53_cast_fp16")];
            tensor<int32, [1]> input_55_axes_0 = const()[name = string("input_55_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_3_norm2_weight_to_fp16 = const()[name = string("model_encoder_layer_3_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12491392)))];
            tensor<fp16, [384]> model_encoder_layer_3_norm2_bias_to_fp16 = const()[name = string("model_encoder_layer_3_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12492224)))];
            tensor<fp16, [1, 257, 384]> input_55_cast_fp16 = layer_norm(axes = input_55_axes_0, beta = model_encoder_layer_3_norm2_bias_to_fp16, epsilon = var_46_to_fp16, gamma = model_encoder_layer_3_norm2_weight_to_fp16, x = input_53_cast_fp16)[name = string("input_55_cast_fp16")];
            tensor<fp16, [1536, 384]> model_encoder_layer_3_mlp_fc1_weight_to_fp16 = const()[name = string("model_encoder_layer_3_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12493056)))];
